БухЭксп/Documents/ЭлектроннаяCкладскаяРасписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЭлектроннаяCкладскаяРасписка</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТитулЭкспедитораНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитулЭкспедитораДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаТитулЭкспедитораЭкспедитор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО_ЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаТитулЭкспедитораСоставитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО_ЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитулЭкспедитораИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитулЭкспедитораДатаФормированияФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТитулЭкспедитораВремяФормированияФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИДМинтранс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВходящий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПолученныйТитул</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовРегламентаЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийТитул</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовРегламентаЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РольУчастника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЭкспедитора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>46</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИныеПолучателиСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийШаг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийШагВыполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаТитулЭкспедитораЗаказчик</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО_ЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаказчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>46</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДокументыОснованияЭСР_ЭПД</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Enums/ТипыДокументовЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыДокументовЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктВзаимозачета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктВыполненныхРабот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктНаПередачуПрав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктОРасхождениях</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПриемкиСтроительныхРаботУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктСверкиВзаиморасчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ведомость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГарантийноеПисьмо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПриемкиЕИСУКД</Name>
					<Comment>Титул поставщика из ЕИС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПриемкиЕИСУПД</Name>
					<Comment>Титул поставщика из ЕИС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеСоглашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросКоммерческихПредложений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОбОшибкеЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзвещениеОПолучении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КаталогТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоммерческоеПредложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрактЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСведенийОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировочныйСчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС11</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КС3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МашиночитаемаяДоверенность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗаказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОПродажахКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетОСписанииКомиссионногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТоваровМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеОператораЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрайсЛист</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредложениеОбАннулировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прикладной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеКАкту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатРассмотренияАктаПриемкиЕИСУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатРассмотренияАктаПриемкиЕИСУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеквизитыОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОЗакупкеКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРеализацииКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбИзмененииСтоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеОбЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спецификация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетНаОплату</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетОферта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварнаяНакладная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварнаяНакладнаяРБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОбУточнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УведомлениеОПринятииКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАктЗаказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАктИсполнитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьВыпискаБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДопДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросЗонд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНаОтзывЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНочнойВыписки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИзвещениеОСостоянииЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКвитанция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОшибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПлатежноеПоручение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПлатежноеТребование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПроизвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСоглашениеОбИзмененииСтоимостиПолучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТОРГ12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТОРГ12Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУКД_ИнформацияПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУКД_ИнформацияПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУПД_ИнформацияПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУПД_ИнформацияПродавца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УниверсальноеСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЭ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЭР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/ЭлектроннаяCкладскаяРасписка/Forms/ОсновнаяФорма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ЗначениеКопирования.Пустая() = Ложь 
		И Параметры.ЗначениеКопирования.ЭтоВходящий = Истина Тогда
	    Отказ = Истина; 
	    СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("ФормаБезОбработки") Тогда
		
		// СтандартныеПодсистемы.ПодключаемыеКоманды
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
		// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
		ОбменСГИСЭПД.ПриСозданииНаСервереПодчиненнойФормы(ЭтотОбъект, Отказ, СтандартнаяОбработка);

		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
			
			ОбменСГИСЭПД.ЗаполнитьТаблицуВерсийТитулов(Объект.Ссылка, Объект.Организация, ВерсииТитулов);
			ОбменСГИСЭПД.ЗаполнитьТаблицуЗначенийРеквизитов(Объект.Ссылка, Объект.Организация, СтруктураРеквизитов);
			
		Иначе 
			
			ОбменСГИСЭПД.ЗаполнитьТаблицуЗначенийРеквизитовПоПараметрамФормы(Параметры, СтруктураРеквизитов);
			
			Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
				Объект.ИдентификаторЭкспедитора = Неопределено;
				Объект.ИдентификаторЗаказчика = Неопределено;
			КонецЕсли;
			
		КонецЕсли;
		
		ОрганизацияОписаниеТипов = Метаданные.ОпределяемыеТипы.Организация.Тип;
		КонтрагентОписаниеТипов = Метаданные.ОпределяемыеТипы.КонтрагентБЭД.Тип;

		ОбменСГИСЭПДКлиентСервер.УстановитьДоступностьЭлементовЭСР(ЭтотОбъект);
		
		Если Объект.ЭтоВходящий = Ложь Тогда
			
			Если ЗначениеЗаполнено(Объект.СсылкаТитулЭкспедитораСоставитель) Тогда
				ВариантПоДоверенностиЗаЭкспедитора = 1;
				Элементы.СсылкаТитулЭкспедитораЭкспедитор.ОграничениеТипа = КонтрагентОписаниеТипов;
				Элементы.СсылкаТитулЭкспедитораСоставитель.ОграничениеТипа = ОрганизацияОписаниеТипов;
				Если ЗначениеЗаполнено(Объект.СсылкаТитулЭкспедитораСоставитель) = Ложь Тогда
					Объект.СсылкаТитулГрузоотправителяСоставитель = ИнтеграцияЭДО.ОрганизацияПоУмолчанию();
				КонецЕсли;
			Иначе
				Элементы.СсылкаТитулЭкспедитораЭкспедитор.ОграничениеТипа = ОрганизацияОписаниеТипов;
				Объект.СсылкаТитулЭкспедитораЗаказчик = 
					ОбменСГИСЭПДКлиентСервер.ПолучитьЗначениеРеквизитаИзСтруктурыФормы(ЭтотОбъект, 
					"СсылкаТитулЭкспедитораЗаказчик");	
				Если ЗначениеЗаполнено(Объект.СсылкаТитулЭкспедитораЗаказчик) = Ложь Тогда
					Объект.СсылкаТитулЭкспедитораЗаказчик = ИнтеграцияЭДО.ОрганизацияПоУмолчанию();
					ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элементы.СсылкаТитулЭкспедитораЗаказчик, ЭтотОбъект);
				КонецЕсли;
			КонецЕсли;
			
			Элементы.СсылкаТитулЭкспедитораЗаказчик.ОграничениеТипа = КонтрагентОписаниеТипов;
						
			МассивЭлементов = Новый Массив;
			МассивЭлементов.Добавить(Элементы.СсылкаТитулЭкспедитораСоставитель);
			Если ЗначениеЗаполнено(Объект.СсылкаТитулЭкспедитораСоставитель) Тогда
				МассивЭлементов.Добавить(Элементы.СсылкаТитулЭкспедитораСоставитель);
			КонецЕсли;
			МассивЭлементов.Добавить(Элементы.СсылкаТитулЭкспедитораЗаказчик);
			
			ОбменСГИСЭПДКлиентСервер.ПоказатьОшибкиПоКонтрагентам(ЭтотОбъект, МассивЭлементов);
			
			Элементы.ГруппаРеквизитаТитулЭкспедитораНомер.Видимость = Ложь;
			Элементы.ЗаголовокНомер.Заголовок = "Номер"; 
			
				
			ОписаниеСтрокИдентификатор = Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(36,ДопустимаяДлина.Фиксированная));
			Элементы.ТитулЭкспедитораУИДПорЭксп.ОграничениеТипа = ОписаниеСтрокИдентификатор;
			
			
			ОпределенДоговорЭПД = ОбменСГИСЭПД.ОпределенДоговорЭПД();
			
			Элементы.ГруппаРеквизитаЗаполнитьПоСсылкеТитулЭкспедитораРеквизитыДоговора.Видимость = ОпределенДоговорЭПД;
			Элементы.ГруппаРеквизитаЗаполнитьТитулЭкспедитораРеквизитыДоговора.Видимость = Не ОпределенДоговорЭПД;
				
		Иначе
			Элементы.ГруппаРеквизитаНомер.Видимость = Ложь;
			
			Элементы.ГруппаРеквизитаЗаполнитьПоСсылкеТитулЭкспедитораРеквизитыДоговора.Видимость = Ложь;
			Элементы.ГруппаРеквизитаЗаполнитьТитулЭкспедитораРеквизитыДоговора.Видимость = Истина;
		КонецЕсли;

		ЦветВыделенияУчастника = ЦветаСтиля.ЦветВыделенияУчастникаЭПД;
		Если Объект.РольУчастника = 1 Тогда
			Элементы.ГруппаРеквизитаСсылкаТитулЭкспедитораЗаказчик.ЦветФона = ЦветВыделенияУчастника;
		ИначеЕсли Объект.РольУчастника = 3 Тогда
			Элементы.ГруппаРеквизитаСсылкаТитулЭкспедитораЭкспедитор.ЦветФона = ЦветВыделенияУчастника;
		КонецЕсли;
		
		ИзмененСоставУчастников = ЗначениеЗаполнено(Объект.ИдентификаторЗаказчика) = Ложь
									Или ЗначениеЗаполнено(Объект.ИдентификаторЭкспедитора) = Ложь;
	

		ЗаполнитьЗначенияПоУмолчаниюДляТекущегоТитула();
		УстановитьТекущийШагПомощника();
		
		Элементы.ГруппаДокументыНеОтправляютсяВГис.Видимость = Не ОбменСГИСЭПД.СтатусПриемаЭкспедиторскихДокументовВГисЭПД(); 
	
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеОЗаписиВРеестреУведомленийТЭДПоПоследнемуДокументу(Организация, ВидДокумента)
	Возврат ОбменСГИСЭПД.ПолучитьДанныеОЗаписиВРеестреУведомленийТЭДПоПоследнемуДокументу(Организация, ВидДокумента); 
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДанныеОЗаписиВРеестреУведомленийТЭДПоПоследнемуДокументу(Организация)
	
	Если Организация = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Данные = ПолучитьДанныеОЗаписиВРеестреУведомленийТЭДПоПоследнемуДокументу(Организация, Объект.ВидДокумента);
	
	ТитулЭкспедитораНомРеестр = Данные.Номер; 
	ТитулЭкспедитораДатаРеестр = Данные.Дата;
	
	ТитулЭкспедитораНомРеестрПриИзменении(Элементы.ТитулЭкспедитораНомРеестр);
	ТитулЭкспедитораДатаРеестрПриИзменении(Элементы.ТитулЭкспедитораДатаРеестр);
	
КонецПроцедуры

&НаКлиенте
Функция ИдентификаторОтправителя()
	
	Возврат Объект.ИдентификаторЭкспедитора;
	
КонецФункции 

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда) 
		
	Результат = ОбменСГИСЭПДВызовСервера.ДвоичныеДанныеДокументаЭПД(Объект.Ссылка, УникальныйИдентификатор);
	
	Если Результат.ДвоичныеДанные <> Неопределено Тогда
		ПараметрыДиалога = Новый ПараметрыДиалогаПолученияФайлов;
		ПараметрыДиалога.Заголовок = НСтр("ru = 'Выберите путь для сохранения файла'");
		
		НачатьПолучениеФайлаССервера(Результат.ДвоичныеДанные, Результат.ИмяФайла, ПараметрыДиалога);
	Иначе 
		ПоказатьПредупреждение(, НСтр("ru='Не удалось выгрузить файл! Ошибка:'") + Результат.Ошибка, , );	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТитулЭкспедитораНомерПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТитулЭкспедитораДатаПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.ТекущийТитул) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("НеТребуетсяИдентификацияФайла") = Ложь Тогда
		ЗаполнитьУчастников();
		ИнформацияПоПрефиксамТитула = ОбменСГИСЭПДКлиентСервер.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
		ОбменСГИСЭПДКлиент.ЗаполнитьИдентификациюФайлаОбмена(ЭтотОбъект, ИнформацияПоПрефиксамТитула, ИдентификаторОтправителя());	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ТекущийТитул) = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	ИнформацияПоПрефиксамТитула = ОбменСГИСЭПДКлиентСервер.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
	
	Если ИнформацияПоПрефиксамТитула.ВПрограмме = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КонтейнерОтображаемойВерсии = Неопределено;
	
	ОбменСГИСЭПД.ЗаполнитьДополнительныеРеквизитыФормы(ЭтотОбъект, ИнформацияПоПрефиксамТитула.ВПрограмме, КонтейнерОтображаемойВерсии);
	
	НомерВерсии = ОбменСГИСЭПДКлиентСервер.ПолучитьЗначениеРеквизитаИзСтруктурыФормы(ЭтотОбъект, 
		ИнформацияПоПрефиксамТитула.ВПрограмме + "НомерИсправления", 0, КонтейнерОтображаемойВерсии);
	
	Если ПараметрыЗаписи.Свойство("ТребуетсяОбновитьДанныеОПодписантахВСтруктуреФормы") Тогда
		ОбменСГИСЭПД.ОбновитьДанныеОПодписантахВСтруктуреФормы(ЭтотОбъект, НомерВерсии);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("НеДобавлятьВерсию") = Ложь Тогда
		// Запишем версию при необходимости
		ТекущийОбъект.ДополнительныеСвойства.Вставить("НомерВерсии", НомерВерсии);
		
		ИдентификаторФайлаВерсии = Объект[ИнформацияПоПрефиксамТитула.ВПрограмме + "ИдентификаторФайла"];
		
		ДатаВерсии = Объект[ИнформацияПоПрефиксамТитула.ВПрограмме + "ДатаФормированияФайла"]
						+ 60 * 60 * Час(Объект[ИнформацияПоПрефиксамТитула.ВПрограмме + "ВремяФормированияФайла"]) 
						+ 60 * Минута(Объект[ИнформацияПоПрефиксамТитула.ВПрограмме + "ВремяФормированияФайла"]) 
						+ Секунда(Объект[ИнформацияПоПрефиксамТитула.ВПрограмме + "ВремяФормированияФайла"]);
		
		ЭтоНоваяВерсия = Истина;
		Для Каждого СтрокаВерсии Из ВерсииТитулов Цикл
			Если СтрокаВерсии.Титул = ТекущийОбъект.ТекущийТитул 
			И СтрокаВерсии.НомерВерсии = НомерВерсии Тогда
				СтрокаВерсии.ИдентификаторФайла = ИдентификаторФайлаВерсии;	
				ЭтоНоваяВерсия = Ложь;
			КонецЕсли;	
		КонецЦикла;
	
		Если ЭтоНоваяВерсия = Истина Тогда
			НовСтрокаВерсии = ВерсииТитулов.Добавить();
			НовСтрокаВерсии.ДатаВерсии = ДатаВерсии;
			Если НовСтрокаВерсии.ДатаВерсии = Дата(1,1,1) Тогда
				НовСтрокаВерсии.ДатаВерсии = ТекущаяДатаСеанса();
			КонецЕсли;
			НовСтрокаВерсии.ИдентификаторФайла = ИдентификаторФайлаВерсии;
			НовСтрокаВерсии.НомерВерсии = НомерВерсии;
			НовСтрокаВерсии.Титул = ТекущийОбъект.ТекущийТитул;		
		КонецЕсли;
			
		ВерсияТитула = Новый Структура;
		ВерсияТитула.Вставить("НомерВерсии", НомерВерсии);
		ВерсияТитула.Вставить("ИдентификаторФайла", ИдентификаторФайлаВерсии);
		ВерсияТитула.Вставить("Титул", ТекущийОбъект.ТекущийТитул);
		ВерсияТитула.Вставить("ДатаВерсии", ДатаВерсии);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ВерсияТитула", ВерсияТитула);
	КонецЕсли;
	
	МассивВерсийТитула = Неопределено;
	СтруктураРеквизитов.Свойство(ИнформацияПоПрефиксамТитула.ВПрограмме, МассивВерсийТитула);
	Если МассивВерсийТитула <> Неопределено Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("СтруктураРеквизитов", МассивВерсийТитула[Мин(НомерВерсии, МассивВерсийТитула.ВГраница())]);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Оповестить("Запись_ДокументыЭПД", Объект.Ссылка);
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбменСГИСЭПДКлиент.ПриОткрытииПодчиненнойФормы(ЭтотОбъект); 
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  


&НаКлиенте
Процедура ОткрытьЭлектронныйДокумент(Команда)
	
	ИнтерфейсДокументовЭДОКлиент.ОткрытьЭлектронныйДокументОбъектаУчета(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСтатусаОшибкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ОписаниеОшибки" Тогда
		СтандартнаяОбработка = Ложь;
		ОбменСГИСЭПДКлиент.ОткрытьОписаниеОшибки(Объект.Ссылка, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьСтатусаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ТекущиеДелаПоЭДО" Тогда
		СтандартнаяОбработка = Ложь;
		ИнтерфейсДокументовЭДОКлиент.ОткрытьЭлектронныйДокументОбъектаУчета(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЧерезЭДО(Команда)
	
	ЭтотОбъект.Доступность = Ложь;
		
	Если ИзмененСоставУчастников = Истина
		Или ЗначениеЗаполнено(Объект.ИдентификаторЗаказчика) = Ложь
		Или ЗначениеЗаполнено(Объект.ИдентификаторЭкспедитора) = Ложь
		Тогда
		ЗаполнитьУчастников(Истина);
	Иначе
		ОтправитьЧерезЭДОПослеЗаписи();
	  КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЧерезЭДОПовторно(Команда)
	
	ЭтотОбъект.Доступность = Ложь;
	
	// Сейчас при повторной отправке происходит ошибка на стороне оператора,
	// у них это считается дубликатом (одинаковый титул в рамках одного документооборота)
	// Это не верно, т.к. повторная отправка возможна (после УОУ или ошибки от ГИС)
	ОтправитьЧерезЭДОПослеЗаписи(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Проверить(Команда)
	
	Если ЗначениеЗаполнено(Объект.ТекущийТитул) = Ложь Тогда
		Возврат;	
	КонецЕсли;
	
	ЗаполнитьУчастников();
	
	ИнформацияПоПрефиксамТитула = ОбменСГИСЭПДКлиентСервер.ПрефиксТитулаПоЭлементуРегламентаЭДО(Объект.ТекущийТитул);
	ОбменСГИСЭПДКлиент.ЗаполнитьИдентификациюФайлаОбмена(ЭтотОбъект, ИнформацияПоПрефиксамТитула, ИдентификаторОтправителя());
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОшибкиЗаполненияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = ЭтотОбъект["ОшибкиЗаполнения"].НайтиПоИдентификатору(ВыбраннаяСтрока);
	ЭтотОбъект.ПереходыПоОшибкам = ТекущиеДанные.Описание.Переходы;
	ОбменСГИСЭПДКлиент.ПоказатьОшибкуЗаполнения(ЭтотОбъект, ТекущиеДанные, ИдентификаторОтправителя());

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НадписьОшибкиЗакрытьНажатие(Элемент)
	
	Элементы.ГруппаОшибки.Видимость = Ложь;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначенияПоУмолчаниюДляТекущегоТитула()
	
	КонтейнерОтображаемойВерсии = Неопределено;
	
	Если (ЗначениеЗаполнено(Объект.Ссылка) = Ложь 
		Или Объект.ТекущийТитул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭСР_Титул1")) Тогда
				
		Если ЗначениеЗаполнено(Объект.ВидДокумента) = Ложь Тогда
			Объект.ВидДокумента = ЭлектронныеДокументыЭДО.ВидДокументаПоТипу(ПредопределенноеЗначение("Перечисление.ТипыДокументовЭДО.ЭСР"));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ТитулЭкспедитораДата) = Ложь Тогда
			Объект.ТитулЭкспедитораДата = ТекущаяДатаСеанса();	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДокументыОснования(Команда)
	
	ОбменСГИСЭПДКлиент.ОткрытьФормуДокументовОснований(ЭтотОбъект);
					
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчастников(ЭтоНастройкаПередОтправкой = Ложь)
	
	КлючНастроекОтправки = НастройкиЭДОКлиентСервер.НовыйКлючНастроекОтправки();
	КлючНастроекОтправки.ВидДокумента = Объект.ВидДокумента;
	КлючНастроекОтправки.ВсегдаСоздаватьАвтоматическоеПриглашение = Истина;
	
	Если ЗначениеЗаполнено(Объект.СсылкаТитулЭкспедитораСоставитель) Тогда
		СоставительПервогоТитула = Объект.СсылкаТитулЭкспедитораСоставитель;
	Иначе
		СоставительПервогоТитула = Объект.СсылкаТитулЭкспедитораЭкспедитор;	
	КонецЕсли;
	
	СоставительВторогоТитула = Объект.СсылкаТитулЭкспедитораЗаказчик;
	
	КлючНастроекОтправки.Отправитель = СоставительПервогоТитула;
	КлючНастроекОтправки.Получатель = Объект.СсылкаТитулЭкспедитораЗаказчик;
	
	НастройкиОтправки = НастройкиОтправкиЭДОСлужебныйВызовСервера.НастройкиОтправки(КлючНастроекОтправки);
	
	ПараметрыНастройкиОбменаСКонтрагентом = НастройкиЭДОКлиент.НовыеПараметрыНастройкиОбменаСКонтрагентом();
	ПараметрыНастройкиОбменаСКонтрагентом.НастройкаОдногоДокумента = Истина;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КлючНастроекОтправки", КлючНастроекОтправки);
	ДополнительныеПараметры.Вставить("ПараметрыНастройкиОбменаСКонтрагентом", ПараметрыНастройкиОбменаСКонтрагентом);
	ДополнительныеПараметры.Вставить("ПараметрыЗаписи", Новый Структура);
	ДополнительныеПараметры.Вставить("ЭтоНастройкаПередОтправкой", ЭтоНастройкаПередОтправкой);
	
	ОповещениеОкончаниеНастройки = Новый ОписаниеОповещения("ЗаполнитьУчастников_ПослеНастроек", ЭтотОбъект, ДополнительныеПараметры);
	Если НастройкиОтправки = Неопределено И ЭтоНастройкаПередОтправкой = Истина Тогда	
		НастройкиЭДОКлиент.НастроитьОбменСКонтрагентом(КлючНастроекОтправки, ОповещениеОкончаниеНастройки, ПараметрыНастройкиОбменаСКонтрагентом);
	Иначе
		ВыполнитьОбработкуОповещения(ОповещениеОкончаниеНастройки, НастройкиОтправки); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчастников_ПослеНастроек(Настройка, ДополнительныеПараметры) Экспорт
	
	Если Настройка = Неопределено Тогда
		ЭтотОбъект.Доступность = Истина;
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СсылкаТитулЭкспедитораСоставитель) Тогда
		СоставительПервогоТитула = Объект.СсылкаТитулЭкспедитораСоставитель;
	Иначе
		СоставительПервогоТитула = Объект.СсылкаТитулЭкспедитораЭкспедитор;	
	КонецЕсли;
		
	Если Настройка.Отправитель = СоставительПервогоТитула Тогда
		Объект.ИдентификаторЭкспедитора = Настройка.ИдентификаторОтправителя;
	КонецЕсли;
		
	Объект.ИдентификаторЗаказчика = Настройка.ИдентификаторПолучателя;	
																		
	ИзмененСоставУчастников = Ложь;
	
	ЭтоНастройкаПередОтправкой = Неопределено;
	ДополнительныеПараметры.Свойство("ЭтоНастройкаПередОтправкой", ЭтоНастройкаПередОтправкой);
	Если ЭтоНастройкаПередОтправкой = Истина
		И ЗначениеЗаполнено(Объект.ИдентификаторЗаказчика)
		И ЗначениеЗаполнено(Объект.ИдентификаторЭкспедитора) Тогда
			ОтправитьЧерезЭДОПослеЗаписи();
	Иначе
		ЭтотОбъект.Доступность = Истина;
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("НеТребуетсяИдентификацияФайла");
		Записать(ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановитьНомерДокумента()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.УстановитьНовыйНомер();
	
	Возврат ДокументОбъект.Номер;
	
КонецФункции

&НаКлиенте
Процедура ОтправитьЧерезЭДОПослеЗаписи(Повторно = Ложь)
		
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда
		Объект.Номер = УстановитьНомерДокумента();
	КонецЕсли;	
	
	ОбменСГИСЭПДКлиент.ОтправитьЭПД(ЭтотОбъект, Ложь, Повторно);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияДействийПоЭДО(Результат, ДополнительныеПараметры) Экспорт
	
	ДействиеОтправить = ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.Отправить");
	КоличествоОтправлено = Результат.ОбработаноПоДействиям.Получить(ДействиеОтправить);
	
	Если КоличествоОтправлено <> Неопределено И КоличествоОтправлено > 0 Тогда
		Если ДополнительныеПараметры.ЭтоИсправление Тогда
			ОбменСГИСЭПДВызовСервера.ОтметитьИсправлениеДокумента(Объект.Ссылка);	
		КонецЕсли;
		ПараметрыЗаписи = Новый Структура;
		ПараметрыЗаписи.Вставить("НеТребуетсяИдентификацияФайла");
		ПараметрыЗаписи.Вставить("ТребуетсяОбновитьДанныеОПодписантахВСтруктуреФормы");
		Записать(ПараметрыЗаписи);
		
		ОтображаемыеВерсииТитулов = Неопределено;
		
		ТекстОповещения = НСтр("ru = 'Титул """ + Объект.ТекущийТитул + """ отправлен'");		
		ЗаголовокОповещения = НСтр("ru = 'Электронные документы'");	
		ДействиеПриНажатии = Неопределено;
		КартинкаОповещения = БиблиотекаКартинок.ЭмблемаСервиса1СЭДО48;
		
		ПодключитьОбработчикОжидания("ОбновлениеДоступностиЭлементов", 2, Истина);	
		
		#Если Не МобильноеПриложениеКлиент Тогда
		ПоказатьОповещениеПользователя(ЗаголовокОповещения, ДействиеПриНажатии, ТекстОповещения, КартинкаОповещения,
			СтатусОповещенияПользователя.Важное);
		#КонецЕсли
	Иначе
		ЭтотОбъект.Доступность = Истина;
	КонецЕсли;
	
	Если ДополнительныеПараметры.НаборДействий.Получить(ПредопределенноеЗначение("Перечисление.ДействияПоЭДО.ОтправитьВАрхив")) = Истина Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыполненияДействийПоЭДО_ОбработкаОшибки(ИнформацияОбОшибке, СтандартнаяОбработка, ДополнительныеПараметры) Экспорт
	
	ОбменСГИСЭПДКлиент.ОчиститьИдФайлТекущегоТитула(ЭтотОбъект, Истина);
	
	ПодключитьОбработчикОжидания("ОбновлениеДоступностиЭлементов", 2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеДоступностиЭлементов()

	ЭтотОбъект.Доступность = Истина;
	
	ВводимТитулОтзывПоручения = Ложь;
	
	ОбменСГИСЭПДКлиентСервер.УстановитьДоступностьЭлементовЭСР(ЭтотОбъект);
	УстановитьТекущийШагПомощника();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДанныхНаФорме(ИмяЭлемента)
	
	НомерВерсии = 0;
	Для Каждого СтрВерсия Из ВерсииТитулов Цикл
		Если СтрВерсия.Титул = Объект.ТекущийТитул И СтрВерсия.НомерВерсии > НомерВерсии Тогда
			НомерВерсии = СтрВерсия.НомерВерсии;
		КонецЕсли;	
	КонецЦикла;

	СтруктураРеквизитовФормы = Новый Структура(ЭтотОбъект.ОписаниеРеквизитовФормы.ПараметрыФормы);
	СтруктураРеквизитовОбъекта = Новый Структура(ЭтотОбъект.ОписаниеРеквизитовФормы.РеквизитыОбъекта);
	
	Если СтруктураРеквизитовФормы.Свойство(ИмяЭлемента) Тогда
		ЗначениеРеквизита = ЭтотОбъект[ИмяЭлемента];
	ИначеЕсли СтруктураРеквизитовОбъекта.Свойство(ИмяЭлемента) Тогда
		ЗначениеРеквизита = Объект[ИмяЭлемента];
	КонецЕсли;
	
	ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтотОбъект, ИмяЭлемента, ЗначениеРеквизита, , , Истина);
	
КонецПроцедуры

&НаКлиенте
Функция ОписаниеРеквизитовФормы() Экспорт
	
	Возврат ОписаниеРеквизитовФормыСервер();
	
КонецФункции

&НаСервере
Функция ОписаниеРеквизитовФормыСервер()
	
	Возврат ОбменСГИСЭПД.ОписаниеРеквизитовФормы(ЭтаФорма);
		
КонецФункции  

&НаКлиенте
Процедура ЗаполнитьТитулЭкспедитораСведСклад(Команда)
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТитулЭкспедитораУИДЭкспРасПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТитулЭкспедитораУИДЭкспРасНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораЭкспедиторскойРасписки = Новый Структура;
	ПараметрыВыбораЭкспедиторскойРасписки.Вставить("РежимВыбора",Истина);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПодборЭкспедиторскойРаспискиЗавершение", ЭтотОбъект);

	ОткрытьФорму("Документ.ЭлектроннаяЭкспедиторскаяРасписка.ФормаВыбора", ПараметрыВыбораЭкспедиторскойРасписки,
	        ЭтотОбъект, , , , ОбработкаВыбора);
			
КонецПроцедуры
		
&НаКлиенте
Процедура ПодборЭкспедиторскойРаспискиЗавершение(Значение, Данные) Экспорт
	
	Если Значение <> Неопределено Тогда
		
		ДанныеПоРасписке = ПолучитьДанныеПоЭкспедиторскойРасписке(Значение);
		
		ЭтотОбъект.ТитулЭкспедитораУИДЭкспРас = ДанныеПоРасписке.УИДЭкспРас;
		ПриИзмененииДанныхНаФорме("ТитулЭкспедитораУИДЭкспРас");
		
		ЭтотОбъект.ТитулЭкспедитораУИДПорЭксп = ДанныеПоРасписке.УИДПорЭксп;
		ПриИзмененииДанныхНаФорме("ТитулЭкспедитораУИДПорЭксп");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоЭкспедиторскойРасписке(ЭкспедиторскаРасписка)
	
	Результат = Новый Структура("УИДЭкспРас, УИДПорЭксп"); 
	
	Результат.УИДЭкспРас = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭкспедиторскаРасписка, "УИДМинтранс");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗначенияРеквизитовДокументовЭПД.ЗначениеРеквизитаСтрока КАК УИДПорЭксп
		|ИЗ
		|	РегистрСведений.ЗначенияРеквизитовДокументовЭПД КАК ЗначенияРеквизитовДокументовЭПД
		|ГДЕ
		|	ЗначенияРеквизитовДокументовЭПД.Документ = &Документ
		|	И ЗначенияРеквизитовДокументовЭПД.Титул = &Титул
		|	И ЗначенияРеквизитовДокументовЭПД.ИмяРеквизита = &ИмяРеквизита";
	
	Запрос.УстановитьПараметр("Документ", ЭкспедиторскаРасписка);
	Запрос.УстановитьПараметр("ИмяРеквизита", "ТитулЭкспедитораУИДПорЭксп");
	Запрос.УстановитьПараметр("Титул", ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭЭР_Титул1"));

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.УИДПорЭксп = Выборка.УИДПорЭксп;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ТитулЭкспедитораУИДПорЭкспПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТитулЭкспедитораУИДПорЭкспНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыВыбораПоручениеЭкспедитору = Новый Структура;
	ПараметрыВыбораПоручениеЭкспедитору.Вставить("РежимВыбора",Истина);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПодборПорученияЭкспедиторуЗавершение", ЭтотОбъект);

	ОткрытьФорму("Документ.ЭлектронноеПоручениеЭкспедитору.ФормаВыбора", ПараметрыВыбораПоручениеЭкспедитору,
	        ЭтотОбъект, , , , ОбработкаВыбора);
	
КонецПроцедуры  


&НаКлиенте
Процедура ПодборПорученияЭкспедиторуЗавершение(Значение, Данные) Экспорт
	
	Если Значение <> Неопределено Тогда  
		ЭтотОбъект.ТитулЭкспедитораУИДПорЭксп = ПолучитьУИДПорученияЭкспедитора(Значение);
		ПриИзмененииДанныхНаФорме("ТитулЭкспедитораУИДПорЭксп");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьУИДПорученияЭкспедитора(ПоручениеЭкспедитору)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПоручениеЭкспедитору, "УИДМинтранс");
	
КонецФункции

&НаКлиенте
Процедура ТитулЭкспедитораНомРеестрПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ТитулЭкспедитораДатаРеестрПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулЭкспедитораСоставительДоверенность(Команда)
	
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулЭкспедитораДоговор(Команда)	
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Команда.Имя);	
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьТитулЭкспедитораСопроводительныеДокументы(Команда)
	
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТитулЭкспедитораГруз(Команда)
	
	ОбменСГИСЭПДКлиент.ВывестиФормуВводаДанных(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТитулЭкспедитораЭкспедиторПриИзменении(Элемент)

	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
	ПараметрыЗаполнения = Новый Структура ("АдресВСвободнойФорме", Истина);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтотОбъект,,, ПараметрыЗаполнения);
	
	Если Не ВариантПоДоверенностиЗаЭкспедитора Тогда
		ЗаполнитьДанныеОЗаписиВРеестреУведомленийТЭДПоПоследнемуДокументу(Объект.СсылкаТитулЭкспедитораЭкспедитор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТитулЭкспедитораЗаказчикПриИзменении(Элемент)

	ПриИзмененииДанныхНаФорме(Элемент.Имя); 
	
	ПараметрыЗаполнения = Новый Структура ("АдресВСвободнойФорме", Истина);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтотОбъект,,, ПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПоДоверенностиЗаЭкспедитораПриИзменении(Элемент)
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтотОбъект, Элемент.Имя);
	
	ВариантПоДоверенностиЗаЭкспедитораПриИзмененииСервер();

КонецПроцедуры

&НаСервере
Процедура ВариантПоДоверенностиЗаЭкспедитораПриИзмененииСервер()
	
	ОрганизацияОписаниеТипов = Метаданные.ОпределяемыеТипы.Организация.Тип;
	КонтрагентОписаниеТипов = Метаданные.ОпределяемыеТипы.КонтрагентБЭД.Тип;
	
	Если Объект.ЭтоВходящий = Ложь Тогда	
		Если ВариантПоДоверенностиЗаЭкспедитора = 1 Тогда
			Элементы.СсылкаТитулЭкспедитораЭкспедитор.ОграничениеТипа = КонтрагентОписаниеТипов;
			Элементы.СсылкаТитулЭкспедитораСоставитель.ОграничениеТипа = ОрганизацияОписаниеТипов;
		Иначе
			Элементы.СсылкаТитулЭкспедитораЭкспедитор.ОграничениеТипа = ОрганизацияОписаниеТипов;
			Элементы.СсылкаТитулЭкспедитораСоставитель.ОграничениеТипа = Новый ОписаниеТипов("Неопределено");	
			Объект.СсылкаТитулЭкспедитораСоставитель = Неопределено;
			
			ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтотОбъект, 
				"ТитулЭкспедитораПредставительЭкспедитора", , , , Истина);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТитулЭкспедитораСоставительПриИзменении(Элемент)
	
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	
	ИзмененСоставУчастников = Истина;
	
	НаименованиеСоставителя = Строка(Объект.СсылкаТитулЭкспедитораСоставитель);
	
	Если ЗначениеЗаполнено(НаименованиеСоставителя) Тогда
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтотОбъект, 
			"ТитулЭкспедитораПредставительЭкспедитора", НаименованиеСоставителя, , , Истина);
	Иначе
		ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтотОбъект, 
			"ТитулЭкспедитораПредставительЭкспедитора", , , , Истина);	
	КонецЕсли;
	
	ЗаполнитьДанныеОЗаписиВРеестреУведомленийТЭДПоПоследнемуДокументу(Объект.СсылкаТитулЭкспедитораСоставитель);
	
КонецПроцедуры


&НаКлиенте
Процедура СсылкаТитулЭкспедитораДоговорПриИзменении(Элемент)
	ПриИзмененииДанныхНаФорме(Элемент.Имя);
	ОбменСГИСЭПДКлиентСервер.ЗаполнитьРеквизитыПоСсылке(Элемент, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаТитулЭкспедитораДоговорНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Организация = ?(ВариантПоДоверенностиЗаЭкспедитора, Объект.СсылкаТитулЭкспедитораСоставитель, Объект.СсылкаТитулЭкспедитораЭкспедитор);
	Контрагент = Объект.СсылкаТитулЭкспедитораЗаказчик;
	
	ОбменСГИСЭПДКлиентПереопределяемый.ЗаполнениеДоговораНачалоВыбора( Организация, Контрагент, Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИныеПолучатели(Команда)
	
	ТолькоПросмотрИныхПолучателей = Элементы.Страницы.ТекущаяСтраница.ТолькоПросмотр
										Или Элементы.Страницы.ТекущаяСтраница <> Элементы.СтраницаТитулЭкспедитора;
		
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТитулЭкспедитора Тогда
		ИмяТаблицы = "ТитулЭкспедитораИдентификаторыИныхПолучателейФайла";	
	КонецЕсли;
	
	Организация = Неопределено;
	ТипОрганизация = ОбменСГИСЭПДВызовСервера.ПолучитьТипОрганизация();
	Если ТипЗнч(Объект.СсылкаТитулЭкспедитораЭкспедитор) = ТипОрганизация Тогда
		Организация = Объект.СсылкаТитулЭкспедитораЭкспедитор;
	ИначеЕсли ТипЗнч(Объект.СсылкаТитулЭкспедитораСоставитель) = ТипОрганизация Тогда
		Организация = Объект.СсылкаТитулЭкспедитораСоставитель;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) = Ложь Тогда
		ПоказатьПредупреждение(, "Сначала нужно выбрать организацию, для которой настроена учетная запись 1С-ЭДО");	
		Возврат;	
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	
	МассивПолучателей = Новый Массив;
	ИтераторСтроки = 1;
	КлючСтруктуры = ИмяТаблицы + "__" + ИтераторСтроки + "__ИдентификаторИногоПолучателя";
	ЗначениеРеквизита = Неопределено;
	КонтейнерОтображаемойВерсии = ОбменСГИСЭПДКлиентСервер.КонтейнерОтображаемойВерсииРеквизита(ЭтотОбъект, ИмяТаблицы);
	СтруктураВерсииТитула = КонтейнерОтображаемойВерсии.СтруктураРеквизитовЗаполнение[КонтейнерОтображаемойВерсии.ПрефиксТитула][КонтейнерОтображаемойВерсии.НомерВерсии];
	Пока СтруктураВерсииТитула.Свойство(КлючСтруктуры, ЗначениеРеквизита) Цикл
		Если ЗначениеРеквизита <> Объект.ИдентификаторЗаказчика
			И ЗначениеРеквизита <> Объект.ИдентификаторЭкспедитора Тогда
			МассивПолучателей.Добавить(ЗначениеРеквизита);
		КонецЕсли;
		ИтераторСтроки = ИтераторСтроки + 1;
		КлючСтруктуры = ИмяТаблицы + "__" + ИтераторСтроки + "__ИдентификаторИногоПолучателя";
	КонецЦикла;
	
	ПараметрыФормы.Вставить("ВидДокумента", Объект.ВидДокумента);
	ПараметрыФормы.Вставить("ИмяТаблицы", ИмяТаблицы);
	ПараметрыФормы.Вставить("МассивПолучателей", МассивПолучателей);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотрИныхПолучателей);
	
	ОписаниеИныеПолучатели_Закрытие = Новый ОписаниеОповещения("ИныеПолучатели_Закрытие", ЭтотОбъект, ПараметрыФормы);
	
	ОткрытьФорму("Документ.ЭлектроннаяCкладскаяРасписка.Форма.ИныеПолучатели", ПараметрыФормы, ЭтотОбъект, 
					УникальныйИдентификатор, , , ОписаниеИныеПолучатели_Закрытие, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
					
КонецПроцедуры

&НаКлиенте
Процедура ИныеПолучатели_Закрытие(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		ОбменСГИСЭПДКлиентСервер.УдалитьСтрокиТаблицыИзСтруктурыФормы(ЭтотОбъект, ДополнительныеПараметры.ИмяТаблицы);
		ИтераторСтроки = 1;
		Для Каждого ИДПолучателя Из Результат Цикл
			Если ИДПолучателя <> Объект.ИдентификаторЗаказчика
			И ИДПолучателя <> Объект.ИдентификаторЭкспедитора Тогда
				КлючКуда = ДополнительныеПараметры.ИмяТаблицы + "__" + ИтераторСтроки + "__ИдентификаторИногоПолучателя";
				ОбменСГИСЭПДКлиентСервер.УстановитьЗначениеРеквизитаВСтруктуреФормы(ЭтотОбъект, КлючКуда, ИДПолучателя, , , Истина);
				ИтераторСтроки = ИтераторСтроки + 1;
			КонецЕсли;
		КонецЦикла;	
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#Область Навигация

&НаКлиенте

Процедура НавигацияКартинкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ОбработатьИзменениеШага(НавигационнаяСсылкаФорматированнойСтроки, НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура Шаг1ОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьИзменениеШага("Шаг1", НавигационнаяСсылкаФорматированнойСтроки);

КонецПроцедуры


#КонецОбласти


#Область НавигацияПоСтраницам

&НаКлиенте
Процедура ИнкрементироватьОтображаемуюВерсиюТитула(ТитулСтрока, Инкремент)
	
	Если Инкремент = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтображаемыеВерсииТитулов = Неопределено Тогда
		ОтображаемыеВерсииТитулов = Новый Структура;
	Иначе
		ТекущееЗначениеВерсии = Неопределено;
		ОтображаемыеВерсииТитулов.Свойство(ТитулСтрока, ТекущееЗначениеВерсии);
		Если ТекущееЗначениеВерсии <> Неопределено Тогда
			ОтображаемыеВерсииТитулов.Вставить(ТитулСтрока, ТекущееЗначениеВерсии + Инкремент);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницы(ОтображаемаяСтраница)
	
	ОтображаемаяСтраницаЦелевая = ПодменитьСтраницуДляТестированияФормы(ОтображаемаяСтраница);

	// Чтобы не отрастали лишние скролл-бары по высоте из-за разного числа элементов
	// на разных страницах, оставляем видимость только у одной - отображаемой страницы.
	
	Для каждого Стр Из Элементы.Страницы.ПодчиненныеЭлементы Цикл
		Стр.Видимость = (Стр = ОтображаемаяСтраницаЦелевая);
	КонецЦикла;

	Элементы.Страницы.ТекущаяСтраница  = ОтображаемаяСтраницаЦелевая;
	
	
	ОбменСГИСЭПД.ПодготовитьФормуДляОтметкиОбязательныхПолей(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ПодменитьСтраницуДляТестированияФормы(ОтображаемаяСтраница)
	
	Возврат ОтображаемаяСтраница;
	
КонецФункции

&НаСервере
Процедура УстановитьТекущийШагПомощника(ПредыдущийТекущийТитул = Неопределено)
	
	Если Параметры.Свойство("ТитулСтраницы") Тогда
		ТитулСтраницы = Параметры.ТитулСтраницы;
	Иначе
		ТитулСтраницы = ?(ЗначениеЗаполнено(Объект.ТекущийТитул), Объект.ТекущийТитул, ПредыдущийТекущийТитул);
	КонецЕсли;
	
	НачатьСПервойСтраницы = ТолькоПросмотр ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка);

	Если НачатьСПервойСтраницы Тогда		
		УстановитьВидимостьСтраницыНачало("Шаг1");		
	Иначе		
		УстановитьВидимостьСтраницыНачало("Шаг1");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьТекущийШагПомощника()
	
	Если ТолькоПросмотр ИЛИ НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтраницыНачало(ИмяШага)

	УстановитьВидимостьСтраницы(Элементы.СтраницаТитулЭкспедитора);
	
	СтруктураНавигации = НавигацияПомощника();
	ИмяШагаПараметр = СтруктураНавигации[ИмяШага].СтруктураПараметровФормы.НавигацияПараметрФормы;
	
	РазместитьНавигацию(ИмяШагаПараметр);
	
	СохранитьТекущийШагПомощника();

КонецПроцедуры

&НаСервере
Функция ИмяПомощника()

	Возврат "ЭлектронноеПоручениеЭкспедитору";

КонецФункции

&НаСервере
Функция НавигацияПомощника()

	СтруктураНавигации = Новый Структура;
	
	СтруктураНавигации.Вставить(НавигацияПомощниковСВозвратомЭПД.ИмяШага(1), СтруктураШагаНачало(1));
	
	
	Для Каждого КиЗ Из СтруктураНавигации Цикл
		ШагВыполнен = Ложь;
		Для Каждого СтрВерсия Из ВерсииТитулов Цикл
			Если СтрВерсия.Титул = КиЗ.Значение.ТипЭлементаРегламента И СтрВерсия.ИдентификаторФайла <> "" Тогда
				ШагВыполнен = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		КиЗ.Значение.Выполнен = ШагВыполнен; 	
		КиЗ.Значение.Доступен = КиЗ.Значение.Доступен Или КиЗ.Значение.Выполнен;
	КонецЦикла;
	
	Возврат СтруктураНавигации;
	
КонецФункции

&НаСервере
Функция СтруктураШагаНачало(НомерШага)
	
	Титул = ПредопределенноеЗначение("Перечисление.ТипыЭлементовРегламентаЭДО.ЭСР_Титул1");
	Отбор = Новый Структура("Титул", Титул);
	СтрокиВерсий = ВерсииТитулов.Выгрузить(Отбор, "НомерВерсии");
	
	СтруктураШага                = НавигацияПомощниковСВозвратомЭПД.НовыйСтруктураШага();
	СтруктураШага.ИмяПомощника   = ИмяПомощника();
	СтруктураШага.НомерШага      = НомерШага;
	СтруктураШага.ТекстНавигации = НСтр("ru='Оформление'");
	СтруктураШага.СтруктураПараметровФормы.НавигацияПараметрФормы = "ТитулЭкспедитора";
	СтруктураШага.ТипЭлементаРегламента = Титул;
	СтруктураШага.Выполнен = ЗначениеЗаполнено(Объект.ТитулЭкспедитораИдентификаторФайла); 
	СтруктураШага.Доступен = Истина;
	СтруктураШага.КоличествоВерсий = Макс(СтрокиВерсий.Количество(), 1);
	СтруктураШага.НомерВерсии = ОтображаемаяВерсияТитула(СтрокиВерсий, "ТитулЭкспедитора");
	Возврат СтруктураШага;
	
КонецФункции

&НаСервере
Функция ОтображаемаяВерсияТитула(СтрокиВерсий, ТитулСтрока)
	
	МаксВерсия = 0;
	Для Каждого СтрокаТЗ Из СтрокиВерсий Цикл
		Если СтрокаТЗ.НомерВерсии > МаксВерсия Тогда
			МаксВерсия = СтрокаТЗ.НомерВерсии;
		КонецЕсли;
	КонецЦикла;
	
	Если ОтображаемыеВерсииТитулов = Неопределено Тогда
		ОтображаемыеВерсииТитулов = Новый Структура;
		ОтображаемыеВерсииТитулов.Вставить(ТитулСтрока, МаксВерсия);
		Возврат МаксВерсия;
	КонецЕсли;
	
	ТекущееЗначениеВерсии = Неопределено;
	ОтображаемыеВерсииТитулов.Свойство(ТитулСтрока, ТекущееЗначениеВерсии);
	
	Если ТекущееЗначениеВерсии = Неопределено Тогда
		ОтображаемыеВерсииТитулов.Вставить(ТитулСтрока, МаксВерсия);
		Возврат МаксВерсия;
	Иначе
		Возврат ТекущееЗначениеВерсии;		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыОтображаемойВерсии(ВыбранныйТитулСтрока, ОтмечатьТекущий)
	
	ВыбранныйТитул = ОбменСГИСЭПДКлиентСервер.ТитулПоПрефиксу("Документ.ЭлектроннаяCкладскаяРасписка", ВыбранныйТитулСтрока); 
	
	Если ЗначениеЗаполнено(ВыбранныйТитул) Тогда
		Отбор = Новый Структура("Титул", ВыбранныйТитул);
		СтрокиВерсий = ВерсииТитулов.Выгрузить(Отбор, "НомерВерсии");
		СтрокиВерсий.Сортировать("НомерВерсии");	
		НомерВерсии = ОтображаемаяВерсияТитула(СтрокиВерсий, ВыбранныйТитулСтрока);
		РеквизитыТекущейВерсииТитула = ОбменСГИСЭПД.ПолучитьВерсиюТитулаДокумента(СтруктураРеквизитов, ВыбранныйТитул, НомерВерсии);
		ОбменСГИСЭПД.ЗаполнитьРеквизитыПоВерсии(ЭтотОбъект, ВыбранныйТитул, НомерВерсии, РеквизитыТекущейВерсииТитула); 
		Если ОтмечатьТекущий = Истина Тогда
			СтруктураСТекущимиДанными = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтотОбъект);
			СтруктураДанныхОбъекта = ОбменСГИСЭПДКлиентСервер.ПолучитьСериализуемыйОбъектСДаннымиДокумента(ЭтотОбъект);
			СтруктураСДаннымиФормыДляОформленияКнопок = ОбменСГИСЭПДКлиентСервер.СтруктураСДаннымиФормыДляОформленияКнопок(ЭтотОбъект);
			
			Результат = ИзменитьОформлениеКнопокНаСервере(СтруктураСТекущимиДанными,
				Неопределено,
				Неопределено,
				СтруктураДанныхОбъекта,
				СтруктураСДаннымиФормыДляОформленияКнопок);
				
			Если Результат.Успешно Тогда
				ЭтотОбъект.АдресДереваСоответствийИтаблицыКнопок = Результат.НовыйАдресВХранилище;	
				МассивОформления = Результат.МассивОформления;
				ОбменСГИСЭПДКлиентСервер.ОформлениеКнопокНаФорме(ЭтотОбъект, СтруктураСТекущимиДанными, МассивОформления);	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура РазместитьНавигацию(ВыбранныйТитулСтрока)

	НавигацияПараметрФормы = ВыбранныйТитулСтрока;
	
	ЗаполнитьРеквизитыОтображаемойВерсии(ВыбранныйТитулСтрока, Истина);

	СтруктураНавигацииПомощника = НавигацияПомощника();
	НавигацияПомощниковСВозвратомЭПД.РазместитьНавигацию(ЭтотОбъект, СтруктураНавигацииПомощника, Параметры);

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеШага(ИмяШага, НавигационнаяСсылка)
	
	ИнкрементВерсии = 0;
	Если НавигационнаяСсылка = "Влево" Тогда
		ИнкрементВерсии = -1;
	ИначеЕсли НавигационнаяСсылка = "Вправо" Тогда
		ИнкрементВерсии = 1;
	КонецЕсли;
	
	Если ИмяШага = "Шаг1" Тогда
		ИнкрементироватьОтображаемуюВерсиюТитула("ТитулЭкспедитора", ИнкрементВерсии);
	КонецЕсли;
	
	ОбменСГИСЭПДКлиентСервер.ИзменитьОформлениеФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти


#Область ОбъектыОбязательныеДляЗаполнения

&НаКлиенте
Процедура ИзменитьОформлениеКнопок(Параметр) Экспорт

	Если Не ЭтотОбъект.НачальноеОформлениеВыполнено Тогда
		ЭтотОбъект.ТребуетсяДополнительноеОформлениеКнопок = Истина;
		Если ЭтотОбъект.СтруктураДополнительногоОформленияКнопок <> Неопределено Тогда
			ЭтотОбъект.СтруктураДополнительногоОформленияКнопок = 
				Новый ФиксированнаяСтруктура("ИмяКнопки, ИдентификаторСтроки");
		Иначе
			ЭтотОбъект.СтруктураДополнительногоОформленияКнопок = Параметр;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	СтруктураСТекущимиДаннымиРеквизитов = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтотОбъект);
	СтруктураДанныхОбъекта = Неопределено;
	СтруктураСДаннымиФормыДляОформленияКнопок = 
		ОбменСГИСЭПДКлиентСервер.СтруктураСДаннымиФормыДляОформленияКнопок(ЭтотОбъект);
	
	Результат = ИзменитьОформлениеКнопокНаСервере(СтруктураСТекущимиДаннымиРеквизитов,
		Параметр.ИмяКнопки,
		Параметр.ИдентификаторСтроки,
		СтруктураДанныхОбъекта,
		СтруктураСДаннымиФормыДляОформленияКнопок);
		
	Если Результат.Успешно Тогда
		ЭтотОбъект.АдресДереваСоответствийИтаблицыКнопок = Результат.НовыйАдресВХранилище;	
		МассивОформления = Результат.МассивОформления;
		ОбменСГИСЭПДКлиентСервер.ОформлениеКнопокНаФорме(ЭтотОбъект,
			СтруктураСТекущимиДаннымиРеквизитов, МассивОформления);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзменитьОформлениеКнопокНаСервере(Знач СтруктураСТекущимиДаннымиРеквизитов,
	ИмяКнопки = Неопределено,
	ИдентификаторСтроки = Неопределено,
	Знач СтруктураДанныхОбъекта,
	Знач СтруктураСДаннымиФормыДляОформленияКнопок)
	
	НовыйАдресВХранилище = ОбменСГИСЭПД.ЗапуститьИзменениеОформленияКнопок(СтруктураСДаннымиФормыДляОформленияКнопок,
		СтруктураСТекущимиДаннымиРеквизитов, ИмяКнопки, ИдентификаторСтроки, СтруктураДанныхОбъекта);

	Результат = ОбменСГИСЭПД.ОбработатьРезультатИзмененияОформленияКнопок(НовыйАдресВХранилище);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(Параметр)
	
	СтруктураСТекущимиДаннымиРеквизитов = ОбменСГИСЭПДКлиентСервер.ПолучитьСтруктуруПоТитулуИВерсии(ЭтотОбъект);
	ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(СтруктураСТекущимиДаннымиРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура ОтметитьОбязательныеНеЗаполненныеЭлементыФормыНаСервере(Знач СтруктураСТекущимиДанными)
	
	ОбменСГИСЭПД.ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(ЭтотОбъект, СтруктураСТекущимиДанными);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОтметитьОбязательныеНеЗаполненныеЭлементыФормы" Тогда
		Если УникальныйИдентификатор <> Параметр Тогда
			Возврат;
		КонецЕсли;
		ОтметитьОбязательныеНеЗаполненныеЭлементыФормы(Параметр);
	ИначеЕсли ИмяСобытия = "ИзменитьОформлениеКнопокФормы" Тогда
		Если УникальныйИдентификатор <> Параметр.УникальныйИдентификаторОбновляемойФормы Тогда
			Возврат;
		КонецЕсли;
		ИзменитьОформлениеКнопок(Параметр);	
	ИначеЕсли СтрНачинаетсяС(ИмяСобытия, "Запись_") И Источник <> Неопределено Тогда
		Если Источник = Объект.СсылкаТитулЭкспедитораЭкспедитор Тогда  
			СсылкаТитулЭкспедитораЭкспедиторПриИзменении(Элементы.СсылкаТитулЭкспедитораЭкспедитор);
		ИначеЕсли Источник = Объект.СсылкаТитулЭкспедитораСоставитель Тогда  
			СсылкаТитулЭкспедитораСоставительПриИзменении(Элементы.СсылкаТитулЭкспедитораСоставитель);
		ИначеЕсли Источник = Объект.СсылкаТитулЭкспедитораЗаказчик Тогда 
			СсылкаТитулЭкспедитораЗаказчикПриИзменении(Элементы.СсылкаТитулЭкспедитораЗаказчик);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
